{
    "Highlights": "Nổi bật",
    "FullName": "Võ Minh Đạt (Luke)",
    "JobTitle": "lập trình web full-stack và hệ thống",
    "Slogan": "Sáng tạo, linh hoạt và luôn tìm kiếm giải pháp tốt nhất",
    "Location": "TP. Hồ Chí Minh, Việt Nam",
    "OpenToRelocation": "Có thể di chuyển nơi ở",
    "WebVersion": "Phiên bản Web",
    "HighlightItem1": "Đã viết <strong>25+</strong> thư viện, script và template để <strong>giảm các việc thủ công</strong>.",
    "HighlightItem2": "Linh hoạt và sáng tạo. Từng làm vai trò <strong>quản trị hệ thống</strong>, tối ưu hệ thống giúp khách hàng tiết kiệm hơn <strong>$1,500/tháng</strong>",
    "HighlightItem3": "Tư duy lập trình và giải quyết vấn đề tốt, nằm trong danh sách Cộng tác của <a target='_blank' data-href='shopifysharp'>2 project lớn trên Github</a>, trong đó một project có hơn <a target='_blank' data-href='restsharp'><strong>10 triệu người dùng</strong></a>.",
    "HighlightItem4": "<a target='_blank' data-href='upwork'>Profile Upwork</a>: <strong>7 trên 9</strong> feedbacks được đánh giá <strong>5 <i class='fa fa-star'></i></strong>.",

    "Review_Content1": "<strong>Super fast</strong> work.<br /><strong>Effective</strong> and completed the project in less time then expected.",
    "Review_Title1": "Client Feedback on a UWP project",
    "Review_Content2": "<strong>Excellent communication</strong> skills [...] After the code review, our lead developer said \"The code is <strong>nice and simple</strong> as well. <strong>I’m impressed</strong>.\"",
    "Review_Title2": "Client Feedback on a problem-solving code method",
    "Review_Content3": "I could not <strong>recommend</strong> him enough. Hired him the night before - had it done by the time I was at work the next morning. <strong>Quickly</strong> fixed a bug during the review process on the spot [...]",
    "Review_Title3": "Client Feedback on a WPF project",

    "Skills_Header": "Kỹ năng",
    "SkillProduction_Title": "Production",
    "SkillProduction_Subtitle": "Đây là các kỹ năng đã được áp dụng vào giải pháp và phần mềm chạy thực tế",
    "SkillResearch_Title": "Đã nghiên cứu",
    "SkillResearch_Subtitle": "Đây là các kỹ năng đã dành nhiều thời gian nghiên cứu nhưng chưa có cơ hội áp dụng",
    "Skill_Item0_Title": "Các công nghệ thuộc Microsoft <strong>.NET Core</strong> và <strong>.NET Framework</strong>",
    "Skill_Item1_Title": "Các công nghệ Web và Trình duyệt",
    "Skill_Item2_Title": "Các công nghệ CSDL: <strong>SQL Server</strong>, SQLite and MySQL",
    "Skill_Item3_Title": "Điện toán đám mây, Server và DevOps",
    "Skill_Item4_Title": "Các kỹ năng khác và kỹ năng mềm",
    "Skill_Item0_0": "<strong>ASP.NET</strong> (MVC, Web API, Core) và Blazor cho các sản phẩm liên quan đến web.",
    "Skill_Item0_1": "Console, WinForm and <strong>WPF</strong> (dùng cả .NET Framework and .NET Core) cho các ứng dụng và service Windows Desktop.",
    "Skill_Item0_2": "XAML/UWP cho ứng dụng Windows Store/Universal/Metro.",
    "Skill_Item0_3": "Các công cụ tăng năng suất làm việc: <strong>Nuget</strong>, T4 Templating, Template Scaffolding",
    "Skill_Item0_4": "Win32 API và COM interop cho các ứng dụng Microsoft Office.",
    "Skill_Item1_0": "HTML5, CSS và Javascript cho ứng dụng front-end và phần mở rộng.",
    "Skill_Item1_1": "<strong>TypeScript, ES6</strong> và SCSS cho các dự án front-end lớn.",
    "Skill_Item1_2": "WebSocket để thực hiện liên lạc realtime, chủ yếu sử dụng Microsoft <strong>SignalR</strong>.",
    "Skill_Item1_3": "<strong>IndexedDB</strong> cho ứng dụng sử dụng CSDL ở client.",
    "Skill_Item1_4": "Canvas và WebGL (thông qua thư viện bậc cao) để xử lý đồ họa.",
    "Skill_Item1_5": "Làm việc với các API của Google (OAuth, GSuite, Drive), Twilio (SMS, Fax), cổng thanh toán (PayPal, Stripe, ClickBank) và nhiều REST API khác.",
    "Skill_Item2_0": "Thiết kế, tối ưu và quản lý CSDL, index và query.",
    "Skill_Item2_1": "Thường làm việc với các framework ORM như Entity Framework và <strong>EF Core</strong>.",
    "Skill_Item3_0": "Có các giải pháp chạy trên cả <strong>Microsoft Azure</strong> và <strong>Amazon AWS</strong>, được bảo vệ bởi <strong>Cloudflare</strong>.",
    "Skill_Item3_1": "Phân phối thư viện trên Nuget và áp dụng CI/CD qua <strong>Azure DevOps</strong>.",
    "Skill_Item3_2": "PowerShell Scripting, <strong>IIS</strong> và các công nghệ khác trên Windows Server.",
    "Skill_Item4_0": "Version Control: SVN <small>(không còn sử dụng)</small> và <strong>Git</strong> trên GitHub, BitBucket và Azure DevOps/Microsoft TFS.",
    "Skill_Item4_1": "Thiết kế theo các hướng DDD, TDD, DI/IoC và CI/CD.",
    "Skill_Item4_2": "Hướng dẫn cho đồng nghiệp và người mới.",
    "Skill_Item4_3": "Tiếng Anh: CEFR C1 (Effective operational proficiency) được cấp bởi British Council IELTS 7.5. Nói tiếng Việt bản địa.",
    "Skill_Showcase": "Một số kỹ năng trên được thể hiện qua các công cụ tại <a data-href='showcase' target='_blank'>trang Công cụ</a>.",
    "Skill_Showcase_Print": "Một số kỹ năng trên được thể hiện qua các công cụ tại trang Công cụ của bản online CV này.",
    "Skill_Research0": "Các kỹ năng DevOps: Docker và Kubernetes.",
    "Skill_Research1": "Lập trình hướng Micro-service.",
    "Skill_Research2": "CSDL NoSQL và cache: MongoDB và Redis.",
    "Skill_Research3": "Lập trình Python với Django.",
    "Skill_Research4": "Lập trình LUA (chủ yếu lập trình và mod game).",

    "Experience_Title": "Kinh nghiệm",

    "Experience_0_Time": "Tháng 12/2015 - Hiện tại",
    "Experience_0_Title": "Kỹ sư phần mềm Freelance",
    "Experience_0_Subtitle": "Upwork",
    "Experience_0_ShortDesc": "<strong>Tất cả 16 việc</strong> đều làm khách hàng rất hài lòng. <strong>7 trên 9</strong> feedback được đánh giá 5 <i class='fa fa-star'></i>. Có 3 khách hàng hài lòng và <strong>thuê lại</strong> sau project đầu, trong đó có một khách hàng đang làm việc được 3 năm.",
    "Experience_0_Item0": "Làm việc với các công nghệ của <strong>Microsoft</strong>: .NET Framework, .NET Core, Windows Server/IIS, Office Integration (Excel Interop).",
    "Experience_0_Item1": "Làm <strong>System Administrator</strong>: Quản lý các máy ảo và tài nguyên khác trên Azure và AWS, có thể làm việc với PowerShell, thiết lập Windows Server và IIS.",
    "Experience_0_Item2": "Giúp cải thiện nhiều kiến thức về HTTP, WebSocket và các công nghệ web: RESTful API, OAuth2, OpenId, Microsoft SignalR. Đã có một project sử dụng IdentityServer4.",
    "Experience_0_Item3": "<strong>Unit Testing</strong> sử dụng MSTest và xUnit. Đã từng làm project sử dụng Selenium để tự động hóa và test trên trình duyệt và UI.",
    "Experience_0_Item4": "Cải thiện kỹ năng bằng cách đóng góp <a target='_blank' data-href='github'>các dự án mã nguồn mở</a>: <a target='_blank' data-href='restsharp'>RestSharp</a>, <a target='_blank' data-href='shopifysharp'>ShopifySharp</a>, Windows Insider, Visual Studio và Visual Code.",
    "Experience_0_Item5": "Nghiên cứu và thiết lập luồng <strong>CI/CD</strong> bằng Azure DevOps. Thử nghiệm một số sản phẩm trên Docker.",

    "Experience_1_Time": "Tháng 8/2014 - Hiện tại",
    "Experience_1_Title": "Kỹ sư phần mềm Senior",
    "Experience_1_Subtitle": "Wisky Solution CO., LTD",
    "Experience_1_ShortDesc": "Làm việc với vai trò cố vấn công nghệ và giúp tăng năng suất làm việc và đổi mới công nghệ.",
    "Experience_1_Item0": "Đóng vai trò <strong>Technical Evangelist</strong>: giúp đỡ và huấn luyện cho các lập trình viên cũ và mới.",
    "Experience_1_Item1": "Tạo một framework theo <strong>Repository Pattern</strong>.",
    "Experience_1_Item2": "Cải thiện luồng làm việc trong công ty khi chuyển sang sử dụng <strong>Git</strong> và <strong>Microsoft Team Foundation Server</strong>.",
    "Experience_1_Item3": "Làm việc với các tầng thấp của <strong>ASP.NET MVC</strong>: Custom Routing và Identity (cho multi-tenant), Dependency Injection và Filters, T4 template (để tự tạo các tập tin tầng Model).",
    "Experience_1_Item4": "Không còn làm việc trực tiếp nhưng được công ty giữ lại ở vai trò CTO, giúp cố vấn về công nghệ.",

    "Experience_2_Time": "Tháng 6/2013 - Tháng 8/2014",
    "Experience_2_Title": "Lập trình viên",
    "Experience_2_Subtitle": "KYMDAN Corporation (Sản xuất Nệm)",
    "Experience_2_ShortDesc": "Làm việc với vai trò lập trình full-stack tại công ty sản xuất sản phẩm.",
    "Experience_2_Item0": "Bảo trì và cải thiện SEO cho website cũ (viết từ năm 2003 sử dụng ASP Web Form)",
    "Experience_2_Item1": "Lập trình front-end: HTML5, CSS3 (mới ra vào thời điểm đó)",
    "Experience_2_Item2": "Tạo các <strong>script tự động</strong> sử dụng Windows Form để liên kết với Microsoft Office (Word và Excel Interop)",

    "Experience_3_Time": "2010 - Tháng 4/2013",
    "Experience_3_Title": "Lập trình Game",
    "Experience_3_Subtitle": "DIVMOB",
    "Experience_3_ShortDesc": "Đây là công việc đầu tiên chuyển lập trình từ sở thích sang một công việc thật sự. Công việc này giúp hiểu biết về cách hệ thống (phần cứng và phần mềm) hoạt động cùng nhau.",
    "Experience_3_Item0": "Làm việc với các thành viên trong các vai trò khác như Game Designer và Graphics Designer.",
    "Experience_3_Item1": "Nghiên cứu các <strong>khái niệm OOP và Kiến trúc Phần mềm</strong> bằng AndEngine (một game engine trên Android) giúp các việc thiết kế hệ thống sau này tốt hơn.",
    "Experience_3_Item2": "Đóng vai trò Technical Leader, giúp các lập trình viên khác giải quyết vấn đề logic, hướng dẫn người mới và tối ưu mã nguồn.",

    "Cert_Title": "Bằng cấp",
    "Cert_MCSD_Title": "MCSD: App Builder",
    "Cert_MCSD_IssueTime": "Cấp vào Tháng 1/2019",
    "Cert_MCSD_Exam0": "Đậu Exam 483: Programming in C# (Tháng 11/2015)",
    "Cert_MCSD_Exam1": "Đậu Exam 486: Developing ASP.NET MVC Web Applications (Tháng 4/2016)",
    "Cert_MCSD_Exam2": "Đậu Exam 487: Developing Microsoft Azure and Web Services (Tháng 1/2019)",
    "Cert_Fpt_Title": "Đại học FPT",
    "Cert_Fpt_Subtitle": "Kỹ sư Phần mềm",
    "Cert_Fpt_Desc": "Trong quá trình học, các công việc giúp rất nhiều cho việc học và ngược lại.",
    "Cert_Fpt_Score0": "GPA: 7.55/10",
    "Cert_Fpt_Score1": "C# and .NET: <strong>9.0</strong>",
    "Cert_Fpt_Score2": "Data Structure &amp; Algorithm: <strong>9.2</strong>",
    "Cert_Fpt_Score3": "Mobile Programming: <strong>9.4</strong>",
    "Cert_Fpt_Exp0": "Tạo một website e-commerce sau đó phát triển thành framework sau này sử dụng bởi công ty.",
    "Cert_Fpt_Exp1": "Tham gia vào việc <strong>đào tạo</strong> sinh viên mới trong các môn Nhập môn.",
    "Cert_Fpt_Exp2": "Tạo game online cho đồ án tốt nghiệp trong đó sử dụng giao thức <strong>real-time WebSocket</strong> là công nghệ mới vào lúc đó."
}